# Introducción a Pandas

Esta es una introducción al paquete *Pandas*, de uso común en ciencia de datos. Pandas singnifica *panel data*, que es un término de econometría para conjuntos de daso de intervalos temporales.

In [1]:
variable_python = 'Alfonso'

In [2]:
print(variable_python)

Alfonso

In [3]:
# Jupyter te muestra en el Out el resultado de una variable
variable_python

'Alfonso'

In [4]:
def hola_mundo(): 
    return 'hola mundo'

In [5]:
hola_mundo()

'hola mundo'

## Instalación de pandas

```bash
pip install pandas
```

ó con Conda:

```bash
conda install pandas
```

In [6]:
# tras esto, puedo importar la librería de pandas

import pandas as pd
import numpy as np

## Series y Dataframes

Las *series* son una columna de datos. Un *Dataframe* es una matriz hecha de varias series (columnas). Vamos a crear un dataframe:

In [9]:
ventas = {
    'libros': [3,2,1,0],
    'discos': [0,1,2,3]
}

ventas_df = pd.DataFrame(ventas)

In [12]:
ventas_df

   libros  discos
0       3       0
1       2       1
2       1       2
3       0       3

In [14]:
ventas_df.head() # esto me trae los cinco primeros elementos

   libros  discos
0       3       0
1       2       1
2       1       2
3       0       3

In [16]:
ventas_df.head(2) # me trae los dos primeros elementos

   libros  discos
0       3       0
1       2       1

In [19]:
ventas_df.describe() # estadísticas básicas

         libros    discos
count  4.000000  4.000000
mean   1.500000  1.500000
std    1.290994  1.290994
min    0.000000  0.000000
25%    0.750000  0.750000
50%    1.500000  1.500000
75%    2.250000  2.250000
max    3.000000  3.000000

In [21]:
# puedo asignar etiquetas a las filas
# dando un índice

ventas_df = pd.DataFrame(ventas, index= ['Enero', 'Febrero', 'Marzo', 'Abril'])

In [23]:
ventas_df

         libros  discos
Enero         3       0
Febrero       2       1
Marzo         1       2
Abril         0       3

In [25]:
imdb = pd.read_csv('https://raw.githubusercontent.com/afoone/machine-learning-course/master/Python%20Pandas%20Tutorial%20A%20Complete%20Introduction%20for%20Beginners/IMDB-Movie-Data.csv')

In [26]:
imdb.head()

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0